import { TitleUtil } from '@/utils/app.util';
import { Metadata } from 'next';

/**
 * ANCHOR Generate Metadata
 * @date 07/05/2025 - 17:49:28
 *
 * @export
 * @async
 * @returns {Promise<Metadata>}
 */
export async function generateMetadata(): Promise<Metadata> {
  // title
  const title: string = TitleUtil('Sign In');

  return {
    title,
  };
}

/**
 * ANCHOR Page
 * @date 07/05/2025 - 17:35:50
 *
 * @returns {*}
 */
const Page = () => {
  // ANCHOR Render
  return (
    <div>
      เบลเยียม (อังกฤษ: Belgium) หรือชื่อทางการว่า ราชอาณาจักรเบลเยียม (อังกฤษ:
      Kingdom of Belgium) เป็นประเทศในยุโรปตะวันตกเฉียงเหนือ
      มีอาณาเขตติดต่อกับประเทศเนเธอร์แลนด์ทางทิศเหนือ
      ติดประเทศเยอรมนีทางทิศตะวันออก ติดประเทศลักเซมเบิร์กทางทิศตะวันออกเฉียงใต้
      ติดประเทศฝรั่งเศสทางทิศใต้ และติดทะเลเหนือทางทิศตะวันตก ด้วยขนาดพื้นที่
      30,689 ตารางกิโลเมตร (11,849 ตารางไมล์) และประชากรราว 11.7 ล้านคน[7]
      ทำให้เป็นประเทศที่มีประชากรหนาแน่นที่สุดอันดับที่ 22 ของโลก
      และเป็นอันดับที่ 6 ของทวีปยุโรป นครบรัสเซลส์ถือเป็นเขตมหานครที่ใหญ่ที่สุด
      และมีสถานะเป็นเมืองหลวงของประเทศซึ่งเป็นที่ตั้งสำนักงานใหญ่ของสหภาพยุโรป
      โดยมีเมืองสำคัญอื่น ๆ ในประเทศได้แก่ แอนต์เวิร์ป, เกนต์, ชาร์เลอรัว,
      ลีแยฌ, บรูช, นามูร์ และเลอเฟิน
      เบลเยียมมีระบอบการปกครองแบบราชาธิปไตยภายใต้รัฐธรรมนูญด้วยระบบรัฐสภา
      โดยแบ่งออกเป็นสามแคว้นที่มีอำนาจปกครองตนเองสูง ได้แก่ แคว้นเฟลมิช
      (แฟลนเดอส์) ตั้งอยู่ทางตอนเหนือซึ่งประชากรส่วนใหญ่พูดภาษาดัตช์, วอลลูน
      (วอลโลเนีย) ทางทิศใต้ซึ่งประชากรส่วนใหญ่พูดภาษาฝรั่งเศส
      และแคว้นนครหลวงบรัสเซลส์
      ซึ่งถือเป็นแคว้นที่เล็กที่สุดและมีความหนาแน่นประชากรสูงที่สุด
      รวมทั้งเป็นแคว้นที่ร่ำรวยที่สุดในแง่ของอัตราจีดีพีเฉลี่ย
      เบลเยียมเป็นที่ตั้งของประชาคมผู้ใช้ภาษาหลักสองประชาคม ได้แก่
      ประชาคมเฟลมิชที่พูดภาษาดัตช์ซึ่งมีประชากรร้อยละ 60
      และประชาคมฝรั่งเศสซึ่งมีประมาณร้อยละ 40
      นอกจากนี้ยังมีประชาคมภาษาเยอรมันกระจายตัวอยู่ในภูมิภาคตะวันออก
      ในขณะที่แคว้นนครหลวงบรัสเซลส์ใช้ทั้งภาษาฝรั่งเศสและภาษาดัตช์
      แต่ภาษาฝรั่งเศสมีบทบาทเป็นภาษาหลัก[8]
      ความหลากหลายทางภาษาและความขัดแย้งทางการเมืองที่เกี่ยวข้องยังสะท้อนให้เห็นในรูปแบบการปกครองที่ซับซ้อนจากการมีรัฐบาลย่อยหลายระดับซึ่งมีอำนาจหน้าที่แตกต่างกันตามรัฐธรรมนูญ[9]
      คำว่าเบลเยียม (Belgium ในภาษาอังกฤษ België และ Belgique
      ในภาษาดัตช์และฝรั่งเศส) มีที่มาจาก Gallia Belgica
      ซึ่งเป็นจังหวัดในยุคโรมัน มีกลุ่มชาว Belgae อยู่อาศัย
      และยังมีรากศัพท์มาจากภาษาละติน โดยมีที่มาจากเหตุการณ์ สงครามกอล ซึ่งนำโดย
      จูเลียส ซีซาร์ เพื่อใช้เรียกพื้นที่ในละแวกนี้ในช่วง ค.ศ. 55[10]
      แผ่นดินของเบลเยียมที่ปรากฏอยู่ในปัจจุบันก่อตั้งขึ้นหลังการปฏิวัติเบลเยียม
      ใน ค.ศ. 1830 ภายหลังได้รับเอกราชจากเนเธอร์แลนด์ตั้งแต่ ค.ศ. 1815
      เบลเยียมจัดอยู่ในกลุ่มประเทศแผ่นดินต่ำเช่นเดียวกับเนเธอร์แลนด์และลักเซมเบิร์ก
      เนื่องจากที่ตั้งของประเทศอยู่ในพื้นที่ต่ำกว่าระดับน้ำทะเล ซึ่งในอดีตกาล
      บริเวณนี้เป็นภูมิภาคที่มีขนาดใหญ่เนื่องจากรวมพื้นที่ทางตอนเหนือของฝรั่งเศสเอาไว้ด้วย
      ตั้งแต่ยุคกลาง
      จุดศูนย์กลางในบริเวณนี้ตั้งอยู่ใกล้กับแม่น้ำสายสำคัญหลายสายทำให้ประเทศเบลเยียมในยุคโบราณมีความเจริญรุ่งเรือง
      และสภาพที่ตั้งยังเป็นประโยชน์ในด้านการค้า
      และการเจริญสัมพันธไมตรีกับประเทศเพื่อนบ้าน
      พื้นที่ของเบลเยียมยังถือเป็นสมรภูมิหลักของชาติต่าง ๆ ในการทำสงครามของยุโรป
      และได้รับสมญานามว่า [11] โดยมีชื่อเสียงในศตวรรษที่ 20
      จากเหตุการณ์สงครามโลกทั้งสองครั้ง
    </div>
  );
};

export default Page;
